7767517
254 319
Input                    in0                      0 1 in0
Split                    splitncnn_0              1 5 in0 1 2 3 4 5
pnnx.Expression          pnnx_expr_67             1 1 1 6
pnnx.Expression          pnnx_expr_65             1 1 2 7
pnnx.Expression          pnnx_expr_64             1 1 3 8
pnnx.Expression          pnnx_expr_62             1 1 4 9
Convolution              convrelu_0               1 1 5 10 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 9=1
Convolution              convrelu_1               1 1 10 11 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=9216 9=1
Split                    splitncnn_1              1 2 11 12 13
Convolution              convrelu_2               1 1 13 14 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              conv_72                  1 1 14 15 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
BinaryOp                 add_0                    2 1 15 12 16 0=0
ReLU                     relu_7                   1 1 16 17
Split                    splitncnn_2              1 2 17 18 19
Convolution              convrelu_3               1 1 19 20 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              conv_74                  1 1 20 21 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
BinaryOp                 add_1                    2 1 21 18 22 0=0
ReLU                     relu_9                   1 1 22 23
Split                    splitncnn_3              1 2 23 24 25
Convolution              convrelu_4               1 1 25 26 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432 9=1
Convolution              conv_76                  1 1 26 27 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_77                  1 1 24 28 0=64 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=2048
BinaryOp                 add_2                    2 1 27 28 29 0=0
ReLU                     relu_11                  1 1 29 30
Split                    splitncnn_4              1 2 30 31 32
Convolution              convrelu_5               1 1 32 33 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_79                  1 1 33 34 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 add_3                    2 1 34 31 35 0=0
ReLU                     relu_13                  1 1 35 36
Split                    splitncnn_5              1 6 36 37 38 39 40 41 42
Convolution              convrelu_6               1 1 42 43 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728 9=1
Convolution              conv_81                  1 1 43 44 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Convolution              conv_82                  1 1 41 45 0=128 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=8192
BinaryOp                 add_4                    2 1 44 45 46 0=0
ReLU                     relu_15                  1 1 46 47
Split                    splitncnn_6              1 2 47 48 49
Convolution              convrelu_7               1 1 49 50 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_84                  1 1 50 51 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_5                    2 1 51 48 52 0=0
ReLU                     relu_17                  1 1 52 53
Split                    splitncnn_7              1 2 53 54 55
Convolution              convrelu_8               1 1 55 56 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_86                  1 1 56 57 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_6                    2 1 57 54 58 0=0
ReLU                     relu_19                  1 1 58 59
Split                    splitncnn_8              1 4 59 60 61 62 63
Convolution              convrelu_9               1 1 40 64 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_88                  1 1 64 65 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 add_7                    2 1 65 37 66 0=0
ReLU                     relu_21                  1 1 66 67
Split                    splitncnn_9              1 2 67 68 69
Convolution              convrelu_10              1 1 69 70 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_90                  1 1 70 71 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 add_8                    2 1 71 68 72 0=0
Split                    splitncnn_10             1 4 72 73 74 75 76
Convolution              convrelu_11              1 1 39 77 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=1
Convolution              conv_92                  1 1 77 78 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_93                  1 1 38 79 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_94                  1 1 63 80 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Split                    splitncnn_11             1 2 80 81 82
Convolution              conv_95                  1 1 82 83 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
pnnx.Expression          pnnx_expr_51             1 1 73 84
pnnx.Expression          pnnx_expr_50             1 1 74 85
ExpandDims               unsqueeze_146            1 1 84 86
ExpandDims               unsqueeze_147            1 1 85 87
Concat                   cat_0                    2 1 86 87 88 0=0
Split                    splitncnn_12             1 2 88 89 90
pnnx.Expression          pnnx_75                  0 1 91
Split                    splitncnn_13             1 3 91 92 93 94
Concat                   cat_1                    2 1 92 89 95 0=0
F.interpolate            F.interpolate_128        2 1 83 95 96
Convolution              conv_96                  1 1 76 97 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
BinaryOp                 mul_9                    2 1 97 96 98 0=2
Reduction                sum_144                  1 1 98 99 0=0 1=0 -23303=1,0 4=0 5=1
ExpandDims               unsqueeze_148            1 1 99 100 -23303=1,0
Sigmoid                  sigmoid_57               1 1 100 101
Split                    splitncnn_14             1 2 101 102 103
pnnx.Expression          pnnx_92                  0 1 104
Split                    splitncnn_15             1 3 104 105 106 107
Concat                   cat_2                    2 1 105 90 108 0=0
F.interpolate            F.interpolate_129        2 1 81 108 109
BinaryOp                 sub_10                   1 1 102 110 0=7 1=1 2=1.0
BinaryOp                 mul_11                   2 1 110 75 111 0=2
BinaryOp                 mul_12                   2 1 103 109 112 0=2
BinaryOp                 add_13                   2 1 112 111 113 0=0
Convolution              conv_97                  1 1 62 114 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
ExpandDims               unsqueeze_149            1 1 9 115
ExpandDims               unsqueeze_150            1 1 7 116
Concat                   cat_3                    2 1 115 116 117 0=0
Split                    splitncnn_16             1 3 117 118 119 120
Concat                   cat_4                    2 1 93 118 121 0=0
F.interpolate            F.interpolate_130        2 1 114 121 122
BinaryOp                 add_14                   2 1 78 79 123 0=0
BinaryOp                 add_15                   2 1 123 122 124 0=0
Convolution              convrelu_12              1 1 61 125 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912 9=1
Convolution              conv_99                  1 1 125 126 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Convolution              conv_100                 1 1 60 127 0=256 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=32768
BinaryOp                 add_16                   2 1 126 127 128 0=0
ReLU                     relu_25                  1 1 128 129
Split                    splitncnn_17             1 2 129 130 131
Convolution              convrelu_13              1 1 131 132 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_102                 1 1 132 133 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_17                   2 1 133 130 134 0=0
ReLU                     relu_27                  1 1 134 135
Split                    splitncnn_18             1 2 135 136 137
Convolution              convrelu_14              1 1 137 138 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_104                 1 1 138 139 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_18                   2 1 139 136 140 0=0
ReLU                     relu_29                  1 1 140 141
Split                    splitncnn_19             1 4 141 142 143 144 145
ReLU                     relu_30                  1 1 113 146
Split                    splitncnn_20             1 2 146 147 148
Convolution              convrelu_15              1 1 148 149 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_106                 1 1 149 150 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 add_19                   2 1 150 147 151 0=0
ReLU                     relu_32                  1 1 151 152
Split                    splitncnn_21             1 2 152 153 154
Convolution              convrelu_16              1 1 154 155 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_108                 1 1 155 156 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 add_20                   2 1 156 153 157 0=0
Split                    splitncnn_22             1 4 157 158 159 160 161
ReLU                     relu_34                  1 1 124 162
Split                    splitncnn_23             1 2 162 163 164
Convolution              convrelu_17              1 1 164 165 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              convrelu_18              1 1 165 166 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              conv_111                 1 1 166 167 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_112                 1 1 163 168 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_113                 1 1 145 169 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Split                    splitncnn_24             1 2 169 170 171
Convolution              conv_114                 1 1 171 172 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
pnnx.Expression          pnnx_expr_34             1 1 158 173
pnnx.Expression          pnnx_expr_33             1 1 159 174
ExpandDims               unsqueeze_151            1 1 173 175
ExpandDims               unsqueeze_152            1 1 174 176
Concat                   cat_5                    2 1 175 176 177 0=0
Split                    splitncnn_25             1 2 177 178 179
Concat                   cat_6                    2 1 94 178 180 0=0
F.interpolate            F.interpolate_131        2 1 172 180 181
Convolution              conv_115                 1 1 161 182 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
BinaryOp                 mul_21                   2 1 182 181 183 0=2
Reduction                sum_145                  1 1 183 184 0=0 1=0 -23303=1,0 4=0 5=1
ExpandDims               unsqueeze_153            1 1 184 185 -23303=1,0
Sigmoid                  sigmoid_58               1 1 185 186
Split                    splitncnn_26             1 2 186 187 188
Concat                   cat_7                    2 1 106 179 189 0=0
F.interpolate            F.interpolate_132        2 1 170 189 190
BinaryOp                 sub_22                   1 1 187 191 0=7 1=1 2=1.0
BinaryOp                 mul_23                   2 1 191 160 192 0=2
BinaryOp                 mul_24                   2 1 188 190 193 0=2
BinaryOp                 add_25                   2 1 193 192 194 0=0
Convolution              conv_116                 1 1 144 195 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Concat                   cat_8                    2 1 107 119 196 0=0
F.interpolate            F.interpolate_133        2 1 195 196 197
BinaryOp                 add_26                   2 1 167 168 198 0=0
BinaryOp                 add_27                   2 1 198 197 199 0=0
Convolution              convrelu_19              1 1 143 200 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_20              1 1 200 201 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824 9=1
Convolution              conv_119                 1 1 201 202 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Convolution              conv_120                 1 1 142 203 0=512 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=131072
BinaryOp                 add_28                   2 1 202 203 204 0=0
Split                    splitncnn_27             1 2 204 205 206
Convolution              convrelu_21              1 1 206 207 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=1
Convolution              convrelu_22              1 1 207 208 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_123                 1 1 208 209 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_29                   2 1 209 205 210 0=0
Split                    splitncnn_28             1 8 210 211 212 213 214 215 216 217 218
ReLU                     relu_41                  1 1 194 219
Split                    splitncnn_29             1 2 219 220 221
Convolution              convrelu_23              1 1 221 222 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_24              1 1 222 223 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_126                 1 1 223 224 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_127                 1 1 220 225 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_30                   2 1 224 225 226 0=0
Split                    splitncnn_30             1 2 226 227 228
ReLU                     relu_44                  1 1 199 229
Split                    splitncnn_31             1 2 229 230 231
Convolution              convrelu_25              1 1 231 232 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_26              1 1 232 233 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_130                 1 1 233 234 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_131                 1 1 230 235 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_31                   2 1 234 235 236 0=0
BatchNorm                bn_60                    1 1 218 237 0=512 1=1.000000e-05
ReLU                     relu_47                  1 1 237 238
Convolution              conv_132                 1 1 238 239 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=49152
Split                    splitncnn_32             1 5 239 240 241 242 243 244
Pooling                  avgpool2d_1              1 1 216 245 0=1 1=5 11=5 12=2 13=2 2=2 3=2 5=1 6=1
BatchNorm                bn_61                    1 1 245 246 0=512 1=1.000000e-05
ReLU                     relu_48                  1 1 246 247
Convolution              conv_133                 1 1 247 248 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=49152
pnnx.Expression          pnnx_expr_19             1 1 211 249
pnnx.Expression          pnnx_expr_18             1 1 212 250
ExpandDims               unsqueeze_154            1 1 249 251
ExpandDims               unsqueeze_155            1 1 250 252
Concat                   cat_9                    2 1 251 252 253 0=0
pnnx.Expression          pnnx_236                 0 1 254
Concat                   cat_10                   2 1 254 253 255 0=0
Split                    splitncnn_33             1 4 255 256 257 258 259
F.interpolate            F.interpolate_134        2 1 248 256 260
BinaryOp                 add_32                   2 1 260 241 261 0=0
Pooling                  avgpool2d_2              1 1 215 262 0=1 1=9 11=9 12=4 13=4 2=4 3=4 5=1 6=1
BatchNorm                bn_62                    1 1 262 263 0=512 1=1.000000e-05
ReLU                     relu_49                  1 1 263 264
Convolution              conv_134                 1 1 264 265 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=49152
F.interpolate            F.interpolate_135        2 1 265 257 266
BinaryOp                 add_33                   2 1 266 242 267 0=0
Pooling                  avgpool2d_3              1 1 214 268 0=1 1=17 11=17 12=8 13=8 2=8 3=8 5=1 6=1
BatchNorm                bn_63                    1 1 268 269 0=512 1=1.000000e-05
ReLU                     relu_50                  1 1 269 270
Convolution              conv_135                 1 1 270 271 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=49152
F.interpolate            F.interpolate_136        2 1 271 258 272
BinaryOp                 add_34                   2 1 272 243 273 0=0
Pooling                  gap_0                    1 1 213 274 0=1 4=1
BatchNorm                bn_64                    1 1 274 275 0=512 1=1.000000e-05
ReLU                     relu_51                  1 1 275 276
Convolution              conv_136                 1 1 276 277 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=49152
Reshape                  reshape_143              1 1 277 278 0=1 1=1 2=-1
F.interpolate            F.interpolate_137        2 1 278 259 279
BinaryOp                 add_35                   2 1 279 244 280 0=0
Concat                   cat_11                   4 1 261 267 273 280 281 0=0
BatchNorm                bn_65                    1 1 281 282 0=384 1=1.000000e-05
ReLU                     relu_52                  1 1 282 283
ConvolutionDepthWise     convdw_158               1 1 283 284 0=384 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=331776 7=4
Concat                   cat_12                   2 1 240 284 285 0=0
BatchNorm                bn_66                    1 1 285 286 0=480 1=1.000000e-05
ReLU                     relu_53                  1 1 286 287
Convolution              conv_137                 1 1 287 288 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=61440
BatchNorm                bn_67                    1 1 217 289 0=512 1=1.000000e-05
ReLU                     relu_54                  1 1 289 290
Convolution              conv_138                 1 1 290 291 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=65536
BinaryOp                 add_36                   2 1 288 291 292 0=0
pnnx.Expression          pnnx_305                 0 1 293
Concat                   cat_13                   2 1 293 120 294 0=0
F.interpolate            F.interpolate_138        2 1 292 294 295
Split                    splitncnn_34             1 2 295 296 297
Sigmoid                  sigmoid_59               1 1 236 298
Split                    splitncnn_35             1 2 298 299 300
BinaryOp                 sub_37                   1 1 299 301 0=7 1=1 2=1.0
BinaryOp                 mul_38                   2 1 301 296 302 0=2
BinaryOp                 add_39                   2 1 302 227 303 0=0
Convolution              conv_139                 1 1 303 304 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 mul_40                   2 1 300 228 305 0=2
BinaryOp                 add_41                   2 1 297 305 306 0=0
Convolution              conv_140                 1 1 306 307 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_42                   2 1 304 307 308 0=0
BatchNorm                bn_68                    1 1 308 309 0=128 1=1.000000e-05
ReLU                     relu_55                  1 1 309 310
Convolution              convrelu_27              1 1 310 311 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_142                 1 1 311 312 0=19 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2432
ExpandDims               unsqueeze_156            1 1 8 313
ExpandDims               unsqueeze_157            1 1 6 314
Concat                   cat_14                   2 1 313 314 315 0=0
pnnx.Expression          pnnx_327                 0 1 316
Concat                   cat_15                   2 1 316 315 317 0=0
F.interpolate            F.interpolate_139        2 1 312 317 out0
